
## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/90314100/runs/514d0305-45a2-4a96-a78c-3fe587409838).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>

## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.launch_instance["vm-test-03"].proxmox_virtual_environment_file.user_data_cloud_config will be created
+   resource "proxmox_virtual_environment_file" "user_data_cloud_config" {
+       content_type           = "snippets"
+       datastore_id           = "local"
+       file_modification_date = (known after apply)
+       file_name              = (known after apply)
+       file_size              = (known after apply)
+       file_tag               = (known after apply)
+       id                     = (known after apply)
+       node_name              = "frodo"
+       overwrite              = true
+       timeout_upload         = ***800
+
       source_raw {
+           data      = <<-EOT
                #cloud-config
                timezone: Asia/Manila
                package_update: true
                packages:
-                   qemu-guest-agent
-                   net-tools
-                   curl
                runcmd:
-                   systemctl enable qemu-guest-agent
-                   systemctl start qemu-guest-agent
-                   echo "done" > /tmp/cloud-config.done
            EOT
+           file_name = "user-data-cloud-config.yaml"
+           resize    = 0
        }
    }

  # module.launch_instance["vm-test-03"].proxmox_virtual_environment_vm.server will be created
+   resource "proxmox_virtual_environment_vm" "server" {
+       acpi                    = true
+       bios                    = "seabios"
+       id                      = (known after apply)
+       ipv4_addresses          = (known after apply)
+       ipv6_addresses          = (known after apply)
+       keyboard_layout         = "en-us"
+       mac_addresses           = (known after apply)
+       migrate                 = false
+       name                    = "vm-test-03"
+       network_interface_names = (known after apply)
+       node_name               = "frodo"
+       on_boot                 = true
+       protection              = false
+       reboot                  = false
+       reboot_after_update     = true
+       scsi_hardware           = "virtio-scsi-pci"
+       started                 = true
+       stop_on_destroy         = true
+       tablet_device           = true
+       tags                    = [
+           "linux",
+           "app3",
        ]
+       template                = false
+       timeout_clone           = ***800
+       timeout_create          = ***800
+       timeout_migrate         = ***800
+       timeout_move_disk       = ***800
+       timeout_reboot          = ***800
+       timeout_shutdown_vm     = ***800
+       timeout_start_vm        = ***800
+       timeout_stop_vm         = 300
+       vm_id                   = (known after apply)
+
       agent {
+           enabled = true
+           timeout = "***5m"
+           trim    = false
+           type    = "virtio"
        }
+
       cpu {
+           cores      = 2
+           hotplugged = 0
+           limit      = 0
+           numa       = false
+           sockets    = ***
+           type       = "qemu64"
+           units      = ***00
        }
+
       disk {
+           aio               = "io_uring"
+           backup            = true
+           cache             = "none"
+           datastore_id      = "local-lvm"
+           discard           = "on"
+           file_format       = (known after apply)
+           file_id           = "local:iso/noble-server-cloudimg-amd64.qcow2.img"
+           interface         = "virtio0"
+           iothread          = true
+           path_in_datastore = (known after apply)
+           replicate         = true
+           size              = 30
+           ssd               = false
        }
+
       initialization {
+           datastore_id         = "local-lvm"
+           meta_data_file_id    = (known after apply)
+           network_data_file_id = (known after apply)
+           type                 = (known after apply)
+           user_data_file_id    = (known after apply)
+           vendor_data_file_id  = (known after apply)
+
           dns {
+               domain  = "infradead.internal"
+               servers = [
+                   "***.***.***.***",
+                   "8.8.8.8",
                ]
            }
+
           ip_config {
+               ipv4 {
+                   address = "***92.***68.5***.33/24"
+                   gateway = "***92.***68.5***.***"
                }
            }
+
           user_account {
+               keys     = [
+                   "***",
                ]
+               password = (sensitive value)
+               username = (sensitive value)
            }
        }
+
       memory {
+           dedicated      = ***024
+           floating       = 0
+           keep_hugepages = false
+           shared         = 0
        }
+
       network_device {
+           bridge      = "vmbr0"
+           enabled     = true
+           firewall    = false
+           mac_address = (known after apply)
+           model       = "virtio"
+           mtu         = 0
+           queues      = 0
+           rate_limit  = 0
+           vlan_id     = (sensitive value)
        }
+
       vga (known after apply)
    }

  # module.launch_instance["vm-test-04"].proxmox_virtual_environment_file.user_data_cloud_config will be created
+   resource "proxmox_virtual_environment_file" "user_data_cloud_config" {
+       content_type           = "snippets"
+       datastore_id           = "local"
+       file_modification_date = (known after apply)
+       file_name              = (known after apply)
+       file_size              = (known after apply)
+       file_tag               = (known after apply)
+       id                     = (known after apply)
+       node_name              = "frodo"
+       overwrite              = true
+       timeout_upload         = ***800
+
       source_raw {
+           data      = <<-EOT
                #cloud-config
                timezone: Asia/Manila
                package_update: true
                packages:
-                   qemu-guest-agent
-                   net-tools
-                   curl
                runcmd:
-                   systemctl enable qemu-guest-agent
-                   systemctl start qemu-guest-agent
-                   echo "done" > /tmp/cloud-config.done
            EOT
+           file_name = "user-data-cloud-config.yaml"
+           resize    = 0
        }
    }

  # module.launch_instance["vm-test-04"].proxmox_virtual_environment_vm.server will be created
+   resource "proxmox_virtual_environment_vm" "server" {
+       acpi                    = true
+       bios                    = "seabios"
+       id                      = (known after apply)
+       ipv4_addresses          = (known after apply)
+       ipv6_addresses          = (known after apply)
+       keyboard_layout         = "en-us"
+       mac_addresses           = (known after apply)
+       migrate                 = false
+       name                    = "vm-test-04"
+       network_interface_names = (known after apply)
+       node_name               = "frodo"
+       on_boot                 = true
+       protection              = false
+       reboot                  = false
+       reboot_after_update     = true
+       scsi_hardware           = "virtio-scsi-pci"
+       started                 = true
+       stop_on_destroy         = true
+       tablet_device           = true
+       tags                    = [
+           "linux",
+           "app4",
        ]
+       template                = false
+       timeout_clone           = ***800
+       timeout_create          = ***800
+       timeout_migrate         = ***800
+       timeout_move_disk       = ***800
+       timeout_reboot          = ***800
+       timeout_shutdown_vm     = ***800
+       timeout_start_vm        = ***800
+       timeout_stop_vm         = 300
+       vm_id                   = (known after apply)
+
       agent {
+           enabled = true
+           timeout = "***5m"
+           trim    = false
+           type    = "virtio"
        }
+
       cpu {
+           cores      = 2
+           hotplugged = 0
+           limit      = 0
+           numa       = false
+           sockets    = ***
+           type       = "qemu64"
+           units      = ***00
        }
+
       disk {
+           aio               = "io_uring"
+           backup            = true
+           cache             = "none"
+           datastore_id      = "local-lvm"
+           discard           = "on"
+           file_format       = (known after apply)
+           file_id           = "local:iso/jammy-server-cloudimg-amd64.qcow2.img"
+           interface         = "virtio0"
+           iothread          = true
+           path_in_datastore = (known after apply)
+           replicate         = true
+           size              = 30
+           ssd               = false
        }
+
       initialization {
+           datastore_id         = "local-lvm"
+           meta_data_file_id    = (known after apply)
+           network_data_file_id = (known after apply)
+           type                 = (known after apply)
+           user_data_file_id    = (known after apply)
+           vendor_data_file_id  = (known after apply)
+
           dns {
+               domain  = "infradead.internal"
+               servers = [
+                   "***.***.***.***",
+                   "8.8.8.8",
                ]
            }
+
           ip_config {
+               ipv4 {
+                   address = "***92.***68.5***.34/24"
+                   gateway = "***92.***68.5***.***"
                }
            }
+
           user_account {
+               keys     = [
+                   "***",
                ]
+               password = (sensitive value)
+               username = (sensitive value)
            }
        }
+
       memory {
+           dedicated      = ***024
+           floating       = 0
+           keep_hugepages = false
+           shared         = 0
        }
+
       network_device {
+           bridge      = "vmbr0"
+           enabled     = true
+           firewall    = false
+           mac_address = (known after apply)
+           model       = "virtio"
+           mtu         = 0
+           queues      = 0
+           rate_limit  = 0
+           vlan_id     = (sensitive value)
        }
+
       vga (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
!   launch_instance = [
        # (*** unchanged element hidden)
        "vm-test-02",
+       "vm-test-03",
+       "vm-test-04",
    ]

```

</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>